<?php
function accountMsg($msg_code) {
	$regist_info = array(
		'100' => '密码过短', 
		'101' => '密码必须包含数字和字母',
		'102' => '两次密码不一致',
		'103' => '手机号或密码错误',
		'104' => '验证码超时',
		'105' => '验证码错误',
		'106' => '注册成功',
		'107' => '登陆成功',
		'108' => '修改成功',
		'109' => '登陆状态过期，请重新登录',
		'110' => '用户名已存在',
		'111' => '修改失败',
		'112' => '电话号码格式错误',
		'113' => '验证码获取成功',
		'114' => '验证码获取失败',
		'115' => '验证码错误',
		'116' => '验证码已过期',
		'117' => '密码错误',
		'118' => '验证码有效期为5分钟'
	);
	$regist_msg = ['code' => $msg_code, 'message' => $regist_info[$msg_code]];
	return $regist_msg;
}

function nodeMsg($msg_code){
	$node_info = array(
		'200' => '节点名称超长', 
		'201' => '分红预期不能低于100000',
		'202' => '节点简介不能超过500字',
		'203' => '创始人姓名不能超过6个字',
		'204' => '电话号码格式错误',
		'205' => '创始人发展经历不能超过500字',
		'206' => '团队成员及简介不能超过500字',
		'207' => '竞选类别不存在',
		'208' => '',
		'209' => '',
		'210' => '',
		'211' => ''
	);
	$regist_msg = ['code' => $msg_code, 'message' => $node_info[$msg_code]];
	return $regist_msg;
}

function voteMsg($msg_code){
	$vote_info = array(
		'300' => '余额不足无法投票', 
		'301' => '投票成功',
		'302' => '余额扣除失败',
		'303' => '投票失败',
		'304' => '撤销失败',
		'305' => '撤销申请成功',
		'306' => '撤销申请成功，请勿重复操作',
		'307' => '已撤销',
		'308' => '',
		'309' => '',
		'310' => '',
		'311' => ''
	);
	$regist_msg = ['code' => $msg_code, 'message' => $vote_info[$msg_code]];
	return $regist_msg;
}

function walletMsg($msg_code){
	$wallet_info = array(
		'400' => '获取以太坊钱包地址失败', 
		'401' => '余额不足，无法提币',
		'402' => '用户扣币失败',
		'403' => '提币申请成功',
		'404' => '',
		'405' => '',
		'406' => '',
		'407' => '',
		'408' => '',
		'409' => '',
		'410' => '',
		'411' => ''
	);
	$regist_msg = ['code' => $msg_code, 'message' => $wallet_info[$msg_code]];
	return $regist_msg;
}

function bonusMsg($msg_code){
	$wallet_info = array(
		'500' => '获取分红数据失败', 
		'501' => '分红账户的余额不足',
		'502' => '分红额度过少',
		'503' => '分红转出失败',
		'504' => '分红节点未找到',
		'505' => '分红成功',
		'506' => '分红转出失败',
		'507' => '分红转入失败',
		'508' => '分红转账失败',
		'509' => '',
		'510' => '',
		'511' => ''
	);
	$regist_msg = ['code' => $msg_code, 'message' => $wallet_info[$msg_code]];
	return $regist_msg;
}